OpenFOAM-2.3.1/tutorials/mesh/foamyHexMesh/mixerVessel/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    ".*"
    {
        type           fixedValue;
        value          $internalField;
    }

    gasInlet
    {
        type           fixedValue;
        value          uniform (0 0 0.5);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi;
        value           $internalField;
    }

    "(shaftRotating|stirrer)"
    {
        type            movingWallVelocity;
        value           $internalField;
    }

    shaft
    {
        type            rotatingWallVelocity;
        origin          (0 0 0);
        axis            (0 0 1);
        omega           -5;
    }

    "AMI.*"
    {
        type            cyclicAMI;
        value           $internalField;
    }
}


// ************************************************************************* //
